of70/tutorials/rheoHeatFoam/OtherTests/channelEDF/PTT/DebyeHuckel/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273;

boundaryField
{
    inlet
    {
	type            fixedValue;
	value           uniform 320;  
    }
   
    walls
    {
	type            heatFlux; 
	
	// Fixed flux
	Q               0;
	q               uniform 0;
	
	// Convection
	h               uniform 100;
	Ta              273;
	
	// Radiation
	Ts              0;
	emissivity      0;
	
	value           uniform 273;     
    }
    
    symmetry
    {
	type            symmetryPlane;       
    }

    outlet
    {
	type            zeroGradient;         
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
